#### 데이터 프레임 만들기

In [3]:
import pandas as pd

df = pd.DataFrame({'name' : ['Lee, Jiwon', 'Ahn, Hyungjoo','Jung, Seunguk'],
                   'year_univ' : ['Senior', 'Senior', 'Senior'],
                   'age' : [24, 25, 24],
                   'hobby' : ['travel', 'hiking', 'violin'],
                   'nationality' : ['Korea', 'Korea', 'Korea']
                  })

In [4]:
df

            name year_univ  age   hobby nationality
0     Lee, Jiwon    Senior   24  travel       Korea
1  Ahn, Hyungjoo    Senior   25  hiking       Korea
2  Jung, Seunguk    Senior   24  violin       Korea

#### Define a new index

In [9]:
df.index = df.name
df.drop(['name'], axis=1, inplace=True)
df

              year_univ  age   hobby nationality
name
Lee, Jiwon       Senior   24  travel       Korea
Ahn, Hyungjoo    Senior   25  hiking       Korea
Jung, Seunguk    Senior   24  violin       Korea

#### Save a file as .csv format

In [13]:
df.to_csv('C:/Users/cdbre/Desktop/MyLife/2022-2/ML/Week2_practice.csv')

#### Load csv file back to python

In [14]:
df_new = pd.read_csv('C:/Users/cdbre/Desktop/MyLife/2022-2/ML/Week2_practice.csv')
df_new

            name year_univ  age   hobby nationality
0     Lee, Jiwon    Senior   24  travel       Korea
1  Ahn, Hyungjoo    Senior   25  hiking       Korea
2  Jung, Seunguk    Senior   24  violin       Korea

#### Try some methods

In [26]:
# Null이 아닌 값의 수
print('count\n', df_new.count())

count
 name           3
year_univ      3
age            3
hobby          3
nationality    3
dtype: int64

In [28]:
# 중복된 값 빼고 
print('nunique\n', df_new.nunique())

nunique
 name           3
year_univ      1
age            2
hobby          3
nationality    1
dtype: int64

In [33]:
# 칼럼 합
print('sum\n', df_new.age.sum())

# 칼럼 평균
print('mean\n', df_new.age.mean(), '\n')

# 칼럼 중위수
print('median\n', df_new.age.median(), '\n')

# 칼럼 최소값
print('min\n', df_new.age.min(), '\n')

# 최소값을 가진 인덱스
print('idxmin\n', df_new.age.idxmin(), '\n')

# 칼럼 최대값
print('max\n', df_new.age.max(), '\n')

# 최대값을 가진 인덱스
print('idxmax\n', df_new.age.idxmax(), '\n')

# 절대값
print('abs\n', df_new.age.abs(), '\n')

# 표준편차
print('std\n', df_new.age.std(), '\n')

# 분산
print('var\n', df_new.age.var(), '\n')

sum
 73
mean
 24.333333333333332

median
 24.0

min
 24

idxmin
 0

max
 25

idxmax
 1

abs
 0    24
1    25
2    24
Name: age, dtype: int64

std
 0.5773502691896258

var
 0.33333333333333337